WS-I/BP1.2/Messages/BaseDataTypes/XmlFormatter/RpcLit/SoapWsdl.BaseDataTypes.XmlFormatter.RpcLit_RetDuration_Client_Request-3.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <a:Action s:mustUnderstand="1">http://tempuri.org/IBaseDataTypesRpcLit/RetDuration</a:Action>
    <a:MessageID>urn:uuid:6dcca736-1e37-446f-b8c8-212c771fe7f3</a:MessageID>
    <a:ReplyTo>
      <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
    </a:ReplyTo>
  </s:Header>
  <s:Body>
    <RetDuration xmlns="http://tempuri.org/">
      <inTimeSpan xmlns="">PT1M</inTimeSpan>
    </RetDuration>
  </s:Body>
</s:Envelope>